Code/CoursesExample/readme.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>readme</title>
<!-- 2015-03-24 Tue 09:48 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">readme</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Introduction</a></li>
<li><a href="#sec-2">2. Your Main Goal</a></li>
<li><a href="#sec-3">3. Bonus Goals</a>
<ul>
<li><a href="#sec-3-1">3.1. Bonus Goals – Medium Difficulty</a></li>
<li><a href="#sec-3-2">3.2. Bonus Goals – Hard Difficulty</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
After talking a lot about smells and refactoring, I thought it might
be nice to do some moderately serious refactoring in a low-stakes
context.  Hence: in-class refactoring activity.  This is a pair
activity, so find someone to work with.  Download the code from SVN
and make sure the tests run.  These unit tests talk to a database
(violating the usual Rules of Unit Tests we’ll talk about when we look
at Feathers) so they need some fancy libraries that should hopefully
be included and work effortlessly.
</p>

<p>
Look at the code – you should see plenty of smells kicking around.
<b>Look especially at the functions that access that database</b>: they
have tons of duplication.
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Your Main Goal</h2>
<div class="outline-text-2" id="text-2">
<p>
Your basic goal is to refactor this code to make it as beautiful as
you can, remove the duplication, and keep the unit tests running.
Talk to your partner and try to get something especially nice and
functional!  Once you finish with that, I have a few bonus goals you
can try your skills on.
</p>

<p>
This is a two day activity.  
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Bonus Goals</h2>
<div class="outline-text-2" id="text-3">
<p>
Strictly if you have time.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Bonus Goals – Medium Difficulty</h3>
<div class="outline-text-3" id="text-3-1">
<p>
So in our hypothetical class system, imagine that we’re concerned
about database load.  Some of our code is executing slowly but we’re
not sure what queries are the problem.  We want to track each SQL
query separately, timing how long it takes from begin to end.  Then we
want to be able to get a report of what the average query time for
each of the different queries the system uses.  Modify the system to
handle this goal.
</p>

<p>
For an extra challenge, write unit tests to verify that the system
works.  Think about how you can control the way the system times
queries so that you can ensure that the averaging is working properly.
Or find some other way to test things out.
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> Bonus Goals – Hard Difficulty</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Imagine that our scheduling database is having problems.  Frequently,
and for no discernible reason, certain queries just throw exceptions.
The DB experts think that it must be something about the exact data
that those queries contain.  You decide to modify the system so that
every time the database throws an exception, a log file is appended to
that lists all parameters of the query that caused the problem.
</p>

<p>
Modify the system to handle this goal.
</p>

<p>
For an extra challenge, write unit tests to verify that the logging
system works.  You’ll need a way to force those mysterious
exceptions&#x2026;for unknown reasons, they never occur with your test
data.  It also might be handy if you could somehow swap out the
logfile for something easy to check in your tests.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-03-24 Tue 09:48</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
